node {
  name: "global_step/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros"
  op: "Fill"
  input: "global_step/Initializer/zeros/shape_as_tensor"
  input: "global_step/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1024
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1024
          }
        }
        string_val: "/home/tony/tflite/datasets/imagenet/train-00000-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00001-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00002-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00003-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00004-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00005-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00006-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00007-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00008-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00009-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00010-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00011-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00012-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00013-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00014-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00015-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00016-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00017-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00018-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00019-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00020-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00021-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00022-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00023-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00024-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00025-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00026-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00027-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00028-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00029-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00030-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00031-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00032-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00033-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00034-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00035-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00036-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00037-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00038-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00039-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00040-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00041-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00042-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00043-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00044-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00045-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00046-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00047-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00048-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00049-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00050-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00051-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00052-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00053-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00054-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00055-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00056-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00057-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00058-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00059-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00060-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00061-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00062-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00063-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00064-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00065-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00066-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00067-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00068-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00069-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00070-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00071-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00072-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00073-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00074-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00075-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00076-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00077-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00078-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00079-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00080-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00081-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00082-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00083-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00084-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00085-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00086-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00087-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00088-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00089-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00090-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00091-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00092-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00093-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00094-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00095-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00096-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00097-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00098-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00099-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00100-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00101-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00102-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00103-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00104-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00105-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00106-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00107-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00108-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00109-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00110-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00111-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00112-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00113-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00114-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00115-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00116-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00117-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00118-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00119-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00120-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00121-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00122-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00123-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00124-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00125-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00126-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00127-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00128-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00129-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00130-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00131-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00132-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00133-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00134-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00135-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00136-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00137-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00138-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00139-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00140-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00141-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00142-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00143-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00144-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00145-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00146-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00147-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00148-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00149-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00150-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00151-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00152-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00153-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00154-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00155-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00156-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00157-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00158-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00159-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00160-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00161-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00162-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00163-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00164-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00165-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00166-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00167-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00168-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00169-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00170-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00171-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00172-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00173-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00174-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00175-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00176-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00177-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00178-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00179-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00180-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00181-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00182-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00183-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00184-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00185-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00186-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00187-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00188-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00189-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00190-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00191-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00192-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00193-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00194-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00195-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00196-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00197-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00198-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00199-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00200-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00201-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00202-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00203-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00204-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00205-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00206-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00207-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00208-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00209-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00210-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00211-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00212-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00213-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00214-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00215-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00216-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00217-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00218-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00219-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00220-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00221-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00222-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00223-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00224-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00225-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00226-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00227-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00228-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00229-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00230-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00231-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00232-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00233-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00234-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00235-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00236-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00237-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00238-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00239-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00240-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00241-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00242-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00243-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00244-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00245-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00246-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00247-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00248-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00249-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00250-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00251-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00252-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00253-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00254-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00255-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00256-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00257-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00258-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00259-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00260-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00261-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00262-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00263-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00264-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00265-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00266-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00267-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00268-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00269-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00270-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00271-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00272-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00273-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00274-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00275-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00276-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00277-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00278-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00279-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00280-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00281-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00282-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00283-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00284-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00285-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00286-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00287-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00288-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00289-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00290-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00291-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00292-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00293-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00294-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00295-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00296-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00297-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00298-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00299-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00300-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00301-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00302-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00303-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00304-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00305-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00306-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00307-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00308-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00309-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00310-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00311-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00312-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00313-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00314-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00315-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00316-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00317-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00318-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00319-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00320-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00321-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00322-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00323-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00324-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00325-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00326-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00327-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00328-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00329-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00330-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00331-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00332-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00333-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00334-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00335-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00336-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00337-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00338-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00339-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00340-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00341-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00342-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00343-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00344-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00345-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00346-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00347-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00348-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00349-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00350-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00351-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00352-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00353-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00354-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00355-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00356-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00357-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00358-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00359-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00360-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00361-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00362-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00363-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00364-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00365-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00366-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00367-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00368-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00369-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00370-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00371-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00372-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00373-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00374-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00375-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00376-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00377-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00378-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00379-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00380-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00381-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00382-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00383-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00384-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00385-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00386-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00387-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00388-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00389-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00390-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00391-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00392-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00393-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00394-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00395-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00396-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00397-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00398-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00399-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00400-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00401-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00402-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00403-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00404-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00405-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00406-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00407-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00408-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00409-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00410-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00411-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00412-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00413-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00414-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00415-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00416-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00417-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00418-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00419-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00420-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00421-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00422-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00423-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00424-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00425-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00426-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00427-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00428-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00429-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00430-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00431-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00432-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00433-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00434-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00435-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00436-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00437-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00438-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00439-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00440-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00441-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00442-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00443-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00444-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00445-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00446-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00447-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00448-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00449-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00450-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00451-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00452-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00453-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00454-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00455-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00456-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00457-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00458-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00459-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00460-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00461-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00462-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00463-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00464-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00465-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00466-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00467-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00468-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00469-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00470-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00471-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00472-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00473-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00474-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00475-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00476-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00477-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00478-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00479-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00480-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00481-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00482-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00483-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00484-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00485-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00486-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00487-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00488-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00489-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00490-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00491-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00492-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00493-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00494-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00495-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00496-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00497-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00498-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00499-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00500-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00501-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00502-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00503-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00504-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00505-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00506-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00507-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00508-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00509-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00510-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00511-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00512-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00513-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00514-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00515-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00516-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00517-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00518-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00519-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00520-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00521-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00522-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00523-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00524-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00525-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00526-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00527-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00528-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00529-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00530-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00531-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00532-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00533-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00534-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00535-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00536-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00537-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00538-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00539-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00540-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00541-of-01024"
        string_val: "/home/tony/tflite/datasets/imagenet/train-00542-of-01024"
